{
  "id": "book-1",
  "title": "The Last Rain",
  "author": "Sai Siva Teja B",
  "cover": "https://images.unsplash.com/photo-1555066931-4365d14bab8c?w=400",
  "pages": [
    {
      "id": "b1-p1",
      "title": "Chapter 1: The Beginning of a Simple Life",
      "content": [
        "Meera and Rajesh were a modest couple living in a small town in South India. Rajesh worked as a civil engineer in a construction firm, while Meera, a twelfth-pass homemaker, took care of their tiny rented house with quiet pride. Their life was simple—mornings began with the aroma of filter coffee, and evenings ended with the sounds of laughter echoing through their narrow lane.",

        "Their son, Aarav, was the heart of their world. A boy full of curiosity, he would often sit beside his father, asking endless questions about how bridges stood strong or how machines worked. Rajesh would patiently explain while Meera smiled from the kitchen door, her hands covered in flour but her heart full of warmth.",

        "They didn’t have much—an old scooter, a few pieces of furniture, and a collection of dreams too fragile to touch—but they had love. It was that kind of love that didn’t need words. It showed in how Rajesh pressed Meera’s hand before leaving for work, in how she waited with dinner until he returned, and in how both of them silently prayed every night for Aarav’s future.",

        "Life was not perfect, but it was complete. Every night, as Aarav drifted to sleep listening to his parents’ whispers, he believed that the world was kind and that home would always feel this safe. Little did he know, fate was waiting quietly outside the window, preparing to change everything forever."
      ]
    },
    {
      "id": "b1-p2",
      "title": "Chapter 2: The Sudden Storm",
      "content": [
        "It was a monsoon evening when the storm came, both in the sky and in Meera’s life. Rajesh had left early for a site visit outside the city, promising to return by nightfall. The rain poured endlessly that day, the kind that turns streets into rivers and muffles every sound except thunder. Meera kept calling his phone, but every time, it said the same thing — 'The number you are trying to reach is not reachable.' She tried to calm herself, convincing her heart that he was just delayed by the weather.",

        "Hours passed. Aarav, who was barely ten, sat beside her, trying to read his homework but looking at his mother’s anxious face every few minutes. Around 10 PM, a loud knock came at the door. Two policemen stood there, drenched, their expressions heavy. Meera froze. Her heart already knew. Her hands trembled as they said the words she never imagined hearing — 'There’s been an accident on the highway. The bus your husband was traveling in lost control and collided with a truck. He didn’t survive.'",

        "The world around her blurred. Her knees gave way, and she fell to the ground clutching the corner of her saree, gasping for air. Aarav ran to her, crying, not fully understanding what was happening. Meera looked at him through her tears — his innocent eyes, his frightened face — and in that instant, she realized she no longer had the luxury to collapse. She pulled him close, whispering through sobs, 'It’s okay, my son... Amma is here. Amma won’t let anything happen.'",

        "The next few days moved in a haze of rituals, condolences, and endless silence. Neighbors came, spoke softly, and left. The house felt different now — colder, emptier. Rajesh’s clothes still hung on the hook, his wallet still lay on the table. Meera would touch them at night, close her eyes, and whisper, 'You wanted him to become an engineer, Rajesh. I promise you, I will make it happen.' It was a vow born out of heartbreak — one that would define every breath she took from that day forward."
      ]
    },
    {
      "id": "b1-p3",
      "title": "Chapter 3: A Mother’s Promise",
      "content": [
        "The morning after Rajesh’s death, Meera sat by the window, watching the neighborhood come alive as if nothing had changed. Milk vendors shouted, children laughed on their way to school, and the world moved on. But inside that tiny house, time had stopped. She looked at the pile of unpaid bills, the school notice for Aarav’s fees, and her own trembling hands. For years, Rajesh had been the provider, the planner, the strength. Now, it was all on her — a woman who had never stepped out alone beyond the grocery store.",

        "She began by visiting small offices nearby, asking if there were any openings. Most smiled politely and said she didn’t have the required qualifications. Some suggested she take up tailoring or housework. Each rejection stung, but every time she looked at Aarav’s face, something inside her refused to break. She joined a typing class at the women’s training center, learning with girls half her age. Her fingers stumbled over the keys, but she stayed late every evening, practicing until the letters became familiar friends.",

        "Money was tight. Meera started cooking extra portions at home and selling lunch boxes to office workers. She skipped meals, saved every coin, and made sure Aarav never missed a single day of school. When her shoes tore, she stitched them. When the electricity bill came due, she pawned her earrings. Aarav, still too young to understand the full weight of their struggle, would sometimes ask, 'Amma, why don’t we buy new clothes like others?' Meera would smile and say, 'Because we are saving for your dreams, my son.'",

        "After nearly two years of relentless effort, she finally got a clerical position in a government office. The salary was modest, but to Meera, it was more than money — it was dignity. The first time she received her pay, she went straight to the temple, placed the envelope before God, and whispered, 'Rajesh, I did it. Our son will have his future.' That night, as she held Aarav close, she silently vowed to never let him feel the absence of a father again."
      ]
    },
    {
      "id": "b1-p4",
      "title": "Chapter 4: Steps into a New World",
      "content": [
        "Years passed, and Meera’s days found a rhythm — mornings spent preparing lunch for Aarav and herself, long hours at the government office typing endless forms, and evenings helping her son with his studies. Her coworkers often admired her quiet determination. She never complained about the heavy workload or the long bus rides. She had only one goal — to see his son become the man Rajesh had dreamed of.",

        "Aarav grew up watching his mother’s struggles and sacrifices. While his classmates boasted about gadgets or vacations, Aarav’s world revolved around books, notebooks, and the promise he made to himself — to make his mother proud. He excelled in school, often studying late into the night while Meera sat nearby, half asleep, her head resting against the wall but her eyes occasionally opening to check on him.",

        "When Aarav expressed his wish to become an engineer, Meera’s heart filled with both joy and fear. The coaching fees for entrance exams were steep, but she refused to let money decide her son’s fate. She sold her last gold bangle — a gift from her wedding — and used that money to enroll him in a coaching institute. Every evening she would wait outside after her office hours, just to accompany him back home safely through the crowded streets.",

        "When the entrance results finally came, Aarav had secured a seat in one of the top engineering colleges in Chennai. Meera cried silently in front of the temple, her palms folded tightly. The tuition was mostly covered by a government merit scholarship, but the hostel and other expenses still needed to be managed. She began taking typing work from home at night, earning a few hundred rupees extra. She never let Aarav see how tired she truly was; her smile never faded. To her, every sleepless night was an investment in his future.",

        "The day Aarav left for college, Meera accompanied him by train, carrying a small tiffin box packed with his favorite lemon rice. At the station, as he boarded, she adjusted his collar and said softly, 'Study well, my son. Don’t worry about me. I’ll manage.' As the train moved, she waved until his face disappeared, then turned away, wiping her tears. The platform echoed with the sound of the departing train, but inside her heart, a silent hope was beginning to grow."
      ]
    },
    {
      "id": "b1-p5",
      "title": "Chapter 5: The Weight of Sacrifice",
      "content": [
        "College life opened new doors for Aarav. He was surrounded by bright minds, advanced labs, and an environment that pushed him to think beyond textbooks. But amid all the progress, he often thought of his mother — her tired eyes, her quiet strength, and the old phone she still used just so he could have a laptop. Every Sunday evening, he would call her. Their conversations were short but filled with warmth — she would always ask if he was eating well, and he would always remind her to take her medicines on time. They both knew those words carried love far deeper than they said aloud.",

        "Meera, on her part, found joy in the smallest things — a postcard from Aarav, a photo from his college fest, or a phone call saying he topped another exam. Her life revolved around those moments. Her coworkers often teased her for talking about her son too much, but she didn’t care. In her heart, every bit of hardship felt lighter knowing it was shaping Aarav’s tomorrow.",

        "One evening, Aarav called her with a trembling voice. 'Amma… I got shortlisted for an international exchange program. It’s in Germany.' Meera froze for a second. She didn’t even know where Germany was on the map. 'Is it good?' she asked softly. 'Very good, Amma,' he replied, excitement bursting through his words. 'They’ll cover my tuition and accommodation — it’s a full scholarship!' Meera’s heart swelled with pride, but she also felt a lump in her throat. The scholarship covered most expenses, yes, but there were still flight tickets, documentation costs, and other formalities.",

        "That night, Meera sat quietly on the terrace under the pale moonlight. The cool breeze brushed against her face as she calculated everything in her mind. She had some savings, and if she took a small personal loan against her provident fund, she could manage. The next day, she did exactly that. She didn’t tell Aarav about it. She only said, 'Everything is taken care of, my son. Just study well and make me proud.'",

        "The day the visa arrived, Aarav ran home from college to tell her first. Meera cooked his favorite meal — puri and aloo curry — though her body ached from her long day at work. That night, they both sat on the balcony, talking about the future. Aarav spoke of machines, inventions, and dreams. Meera just listened, smiling through her tired eyes. She didn’t realize then that sometimes, fate watches the happiest moments closely — as if preparing to test how much a heart can truly bear."
      ]
    },
    {
      "id": "b1-p6",
      "title": "Chapter 6: Flight to a Dream",
      "content": [
        "The day of departure arrived faster than either of them had expected. The house was filled with a bittersweet silence as Meera helped Aarav pack his bags. Every shirt she folded carried the scent of home, every pair of socks tucked in with a mother’s unspoken prayer. Aarav moved around nervously, checking documents again and again. He was excited, but beneath that excitement was a quiet fear — of leaving his mother alone, of stepping into a world he had only seen in pictures.",

        "At the airport, Meera wore her best saree — the same one she had worn during Aarav’s school farewell. Her eyes followed him as he moved through the check-in counters, handling everything on his own. She stood at a distance, smiling proudly, even though her throat burned from holding back tears. When it was finally time to say goodbye, Aarav hugged her tightly. 'I’ll call you every day, Amma. And don’t forget to eat on time,' he said. Meera smiled and replied, 'You don’t worry about me, my son. Just remember why you started all this — for your father, and for yourself.'",

        "As Aarav walked away toward security, Meera’s hand slowly dropped from the air, her eyes moist but proud. The boy she had carried through hunger, sleepless nights, and endless prayers was now flying to a future she could barely imagine. As the plane took off, she whispered softly to herself, 'Go live your dream, my child… I’ve lived mine through you.'",

        "Back home, the emptiness hit her like a wave. She returned from work to silence — no shoes scattered at the door, no voice asking for tea. Still, she found comfort in small routines. She’d talk to his framed photograph every night, sometimes scolding him playfully for forgetting to call, other times crying softly when his calls got shorter due to his busy schedule. The loneliness was heavy, but it was filled with pride.",

        "In Germany, Aarav’s life became a whirlwind of lectures, projects, and internships. He made friends, adapted to the cold winters, and even learned to cook basic food. Every week, he sent a portion of his stipend home, saying, 'Just save it, Amma.' Meera used none of it for herself; she kept it safely aside for the future she hoped they would share. Little did they know that time had its own cruel script — one they couldn’t rewrite, no matter how hard they tried."
      ]
    },
    {
      "id": "b1-p7",
      "title": "Chapter 7: The Offer",
      "content": [
        "The winter sun barely touched the streets of Munich when Aarav received the email. He stared at the screen, numb with disbelief — the company he had interned with for months had offered him a full-time position. A dream carved out of sleepless nights, missed meals, and constant self-doubt had finally come true. For a long time, he simply sat there, smiling through tears that refused to stop.",

        "The first thing he did was call his mother. Meera picked up after two rings, still in her office, the rustle of papers audible in the background. 'Amma,' he said, his voice trembling, 'I got the job. They want me to join next month.' For a moment she didn’t respond. Then came a sound halfway between laughter and sobbing — the sound of dreams breaking free. 'You did it, my son,' she whispered. 'You really did it.'",

        "That night, while Meera sat alone at the small dining table, she replayed his words again and again. The ceiling fan whirred softly above, scattering her tears before they could fall onto her plate. She had imagined this moment a thousand times, but now that it had arrived, it felt unreal. Somewhere inside, she whispered a prayer to her late husband, 'Our boy has made it, Raghav. He’s really made it.'",

        "In Germany, Aarav celebrated with his friends, but his heart remained in India. He sent his mother pictures of his office, his ID card, even the snow outside his window. 'Six more months,' he wrote in one of his messages. 'Then I’ll come home. I’ll bring gifts, Amma — for every festival we missed together.' Her reply came almost instantly: 'Your coming home will be the only gift I want.'"
      ]
    },
    {
      "id": "b1-p8",
      "title": "Chapter 8: The Days That Followed",
      "content": [
        "The following months were some of the happiest they had known in years. Meera’s health, which had once wavered under the strain of long hours and stress, seemed to improve. Her colleagues noticed her glowing face and asked the reason; she would smile and say simply, 'My son has found his place.'",

        "Each evening, after returning from work, she would video-call Aarav. Their conversations flowed between laughter and advice, teasing and care. She would ask if he was eating properly; he would scold her for skipping her medicines. Distance had not weakened their bond — it had refined it into something sacred, something beyond time and miles.",

        "When she told him she had applied for a small housing loan to renovate their old home, he protested. 'Amma, don’t. I’ll send you money next month.' But she smiled. 'Let me do this much for you. I want you to return to a house that feels new.' Her voice, though tired, held a joy that could light any darkness.",

        "Meanwhile, Aarav began planning his visit — six months later, once his probation ended. He booked tentative tickets, marked dates on his calendar, and began buying small gifts: a silk saree, a silver watch, a pair of sandals she had once admired but never bought. Every box he packed was filled not with things, but with love waiting to be delivered."
      ]
    },
    {
      "id": "b1-p9",
      "title": "Chapter 9: The Silent Rain",
      "content": [
        "It was early June when the monsoon arrived. Meera loved the rain; it reminded her of her youth, of washing clothes under gray skies and laughing at puddles. That evening, she stayed a little late at work — a new circular had to be typed and sent before the weekend. Outside, thunder rolled. She texted Aarav, 'Heavy rain today. You’d love it.' He replied with a laughing emoji and a photo of his umbrella, captioned, 'We match, Amma!'",

        "By the time she left the office, the streets were nearly empty. The air smelled of wet earth, and distant lightning lit up the horizon. She booked a cab home, folded her dupatta tighter, and called Aarav once more. He was just leaving his office in Munich. 'Amma, stay safe, okay?' he said. She laughed softly. 'Always, my boy. Always.'",

        "The call dropped as the rain grew heavier. Somewhere along the deserted bypass road, the cab took a wrong turn. By dawn, the city had another headline — one that no one wanted to read. A government employee, a woman returning home, found dead on the outskirts. The driver had been caught hours later, his face calm, as if humanity had long left him.",

        "When Aarav received the call, he didn’t believe it at first. His colleagues tried to hold him, to speak, but he heard nothing. The world around him blurred into noise — airport announcements, rushing feet, sobs. The flight home felt endless; the space beside him remained empty, as though even the air refused to comfort him."
      ]
    },
    {
      "id": "b1-p10",
      "title": "Chapter 10: Ashes and Echoes",
      "content": [
        "He arrived to silence — the kind of silence that weighs on walls. The house smelled faintly of incense and old memories. In the center of the room lay his mother, wrapped in white. Her face was peaceful, almost smiling. He touched her hand — cold, still, unyielding — and fell to his knees. Every success, every plan, every promise turned to ash in that moment.",

        "The rituals passed in fragments he barely remembered — priests chanting, neighbors whispering, the smell of smoke filling the sky. When the last flame died, he felt something inside him die with it. The world didn’t end; it simply lost meaning.",

        "Days became weeks. Aarav refused to return abroad. He spent hours at police stations, courts, and offices, following every detail of the case. His company, informed of the tragedy, placed him on extended compassionate leave. Months later, they offered him a sabbatical — the kind given to employees dealing with profound personal loss. He accepted, but not because he wanted rest; he wanted justice.",

        "He attended every hearing, facing the accused without fear. The media’s interest faded after a few weeks, but Aarav remained. It took almost three years before the final judgment arrived. The driver was sentenced to life imprisonment. The courtroom clapped quietly, but Aarav didn’t. He stood there, tears falling freely, whispering, 'You’ll never understand what you took from me.'"
      ]
    },
    {
      "id": "b1-p11",
      "title": "Chapter 11: The Weight of Rain",
      "content": [
        "Back in Germany, Aarav returned to work under the company’s deferred return policy. His managers welcomed him with quiet respect, offering flexible hours and space to rebuild his life. But life wasn’t something he could rebuild; it was something he had to relearn.",

        "He avoided crowds, avoided laughter. Rain became both comfort and curse — each drop a reminder of that night. Yet, amid his grief, something inside him whispered: her strength still lived within him. He started writing again — small notes, fragments of thoughts, memories of her humming while cooking or adjusting his tie before school.",

        "Those notes grew into an idea. If pain could destroy, maybe it could also build. Using his savings and part of his salary, Aarav founded ‘The Meera Foundation’ in his mother’s name — a trust to support education for children of single mothers. He wanted no child to ever feel that love was powerless against cruelty.",

        "The foundation began small — two students, then five. The letters they sent were clumsy but sincere, filled with gratitude and hope. Each one felt like a heartbeat sent back to him from somewhere beyond the clouds."
      ]
    },
    {
      "id": "b1-p12",
      "title": "Chapter 12: The Return",
      "content": [
        "A year later, Aarav returned to India. The air smelled of wet earth again — monsoon, her favorite season. He carried only one suitcase and a folder filled with scholarship papers. He visited her grave, the rain beginning just as he arrived, as if the heavens had been waiting.",

        "He placed the folder beside the tombstone and whispered, 'Your name will never fade, Amma. You gave me everything. Now it’s my turn to give.' The rain grew heavier, soaking him completely, but he didn’t move. He smiled, looking up, whispering again, 'You’re the rain now, aren’t you? Always finding a way back to me.'",

        "As thunder rolled in the distance, Aarav closed his eyes. He wasn’t alone anymore. She was there — in the rain, in the foundation’s letters, in the children she was still helping through him. Some loves, he realized, never die; they simply change form. And in that quiet revelation, the world finally began to heal."
      ]
    },
    {
      "id": "b1-p13",
      "title": "Chapter 13: The Last Rain",
      "content": [
        "Years rolled on. The Meera Foundation stood tall — not as a monument of pity, but as a rebellion against silence. Every wall held a photograph, every classroom a story of a child who refused to give up. Aarav visited often, watching new lives begin where his own had broken. But no matter how far he came, the memory of that one night — the cab, the rain, the inhumanity — never dulled. It haunted him quietly, like a storm that learned to whisper.",

        "One afternoon, while sorting through a box of his mother’s old belongings, Aarav found small folded notes hidden inside her prayer book. They were written on scraps of paper — some grocery lists on one side, small messages on the other. 'He didn’t eat properly today. I must make him his favorite tomorrow.' Another read, 'Don’t let the world change his kindness.' And one, worn by time, simply said, 'My son will fly someday. I’ll wave from the ground, smiling through my tears.' He pressed them to his chest and broke down — not in sorrow this time, but in reverence for the kind of love that refuses to die.",

        "But even as love filled the room, anger sat beside it. How could someone so ordinary — a cab driver with a family, perhaps — carry such darkness? How could a few minutes of animal cruelty steal decades of a mother’s laughter, a son’s comfort, a family’s peace? There were laws, there were punishments, yet nothing could erase that emptiness. The world moves on too easily, Aarav thought — as if grief expires, as if some lives are worth less because they’re quiet.",

        "He stood by the foundation gate that evening, watching the children run home under umbrellas. The rain had returned — soft at first, then fierce. A little boy turned and shouted, ‘Sir, come join us!’ Aarav smiled faintly. The world was still cruel, still capable of shattering the gentle. But maybe, just maybe, every act of kindness was a way of taking something back from that cruelty — drop by drop.",

        "As he walked inside, he placed his mother’s notes in a glass frame near the entrance. Below them, he carved a single line: 'For every mother who loved in silence, and every child who still hears her in the rain'. The words were small, but they carried the weight of a lifetime.",

        "That night, standing beneath the open sky, Aarav let the rain drench him completely. It no longer felt like grief — it felt like truth. The scars would never fade, and the world might never be fair. But somewhere in the downpour, he could still hear her voice, steady and warm: 'Keep walking, my son. Don’t let the dark make you forget the light.' And so he did — one step, one storm, one heartbeat at a time."
      ]
    }
  ]
}
