{
  "books": [
    {
      "id": "book-1",
      "title": "The Last Rain",
      "author": "Sai Siva Teja B",
      "cover": "https://images.unsplash.com/photo-1555066931-4365d14bab8c?w=400",
      "pages": [
        {
          "id": "b1-p1",
          "title": "Chapter 1: The Beginning of a Simple Life",
          "content": [
            "Meera and Rajesh were a modest couple living in a small town in South India. Rajesh worked as a civil engineer in a construction firm, while Meera, a twelfth-pass homemaker, took care of their tiny rented house with quiet pride. Their life was simple—mornings began with the aroma of filter coffee, and evenings ended with the sounds of laughter echoing through their narrow lane.",

            "Their son, Aarav, was the heart of their world. A boy full of curiosity, he would often sit beside his father, asking endless questions about how bridges stood strong or how machines worked. Rajesh would patiently explain while Meera smiled from the kitchen door, her hands covered in flour but her heart full of warmth.",

            "They didn’t have much—an old scooter, a few pieces of furniture, and a collection of dreams too fragile to touch—but they had love. It was that kind of love that didn’t need words. It showed in how Rajesh pressed Meera’s hand before leaving for work, in how she waited with dinner until he returned, and in how both of them silently prayed every night for Aarav’s future.",

            "Life was not perfect, but it was complete. Every night, as Aarav drifted to sleep listening to his parents’ whispers, he believed that the world was kind and that home would always feel this safe. Little did he know, fate was waiting quietly outside the window, preparing to change everything forever."
          ]
        },
        {
          "id": "b1-p2",
          "title": "Chapter 2: The Sudden Storm",
          "content": [
            "It was a monsoon evening when the storm came, both in the sky and in Meera’s life. Rajesh had left early for a site visit outside the city, promising to return by nightfall. The rain poured endlessly that day, the kind that turns streets into rivers and muffles every sound except thunder. Meera kept calling his phone, but every time, it said the same thing — 'The number you are trying to reach is not reachable.' She tried to calm herself, convincing her heart that he was just delayed by the weather.",

            "Hours passed. Aarav, who was barely ten, sat beside her, trying to read his homework but looking at his mother’s anxious face every few minutes. Around 10 PM, a loud knock came at the door. Two policemen stood there, drenched, their expressions heavy. Meera froze. Her heart already knew. Her hands trembled as they said the words she never imagined hearing — 'There’s been an accident on the highway. The bus your husband was traveling in lost control and collided with a truck. He didn’t survive.'",

            "The world around her blurred. Her knees gave way, and she fell to the ground clutching the corner of her saree, gasping for air. Aarav ran to her, crying, not fully understanding what was happening. Meera looked at him through her tears — his innocent eyes, his frightened face — and in that instant, she realized she no longer had the luxury to collapse. She pulled him close, whispering through sobs, 'It’s okay, my son... Amma is here. Amma won’t let anything happen.'",

            "The next few days moved in a haze of rituals, condolences, and endless silence. Neighbors came, spoke softly, and left. The house felt different now — colder, emptier. Rajesh’s clothes still hung on the hook, his wallet still lay on the table. Meera would touch them at night, close her eyes, and whisper, 'You wanted him to become an engineer, Rajesh. I promise you, I will make it happen.' It was a vow born out of heartbreak — one that would define every breath she took from that day forward."
          ]
        },
        {
          "id": "b1-p3",
          "title": "Chapter 3: A Mother’s Promise",
          "content": [
            "The morning after Rajesh’s death, Meera sat by the window, watching the neighborhood come alive as if nothing had changed. Milk vendors shouted, children laughed on their way to school, and the world moved on. But inside that tiny house, time had stopped. She looked at the pile of unpaid bills, the school notice for Aarav’s fees, and her own trembling hands. For years, Rajesh had been the provider, the planner, the strength. Now, it was all on her — a woman who had never stepped out alone beyond the grocery store.",

            "She began by visiting small offices nearby, asking if there were any openings. Most smiled politely and said she didn’t have the required qualifications. Some suggested she take up tailoring or housework. Each rejection stung, but every time she looked at Aarav’s face, something inside her refused to break. She joined a typing class at the women’s training center, learning with girls half her age. Her fingers stumbled over the keys, but she stayed late every evening, practicing until the letters became familiar friends.",

            "Money was tight. Meera started cooking extra portions at home and selling lunch boxes to office workers. She skipped meals, saved every coin, and made sure Aarav never missed a single day of school. When her shoes tore, she stitched them. When the electricity bill came due, she pawned her earrings. Aarav, still too young to understand the full weight of their struggle, would sometimes ask, 'Amma, why don’t we buy new clothes like others?' Meera would smile and say, 'Because we are saving for your dreams, my son.'",

            "After nearly two years of relentless effort, she finally got a clerical position in a government office. The salary was modest, but to Meera, it was more than money — it was dignity. The first time she received her pay, she went straight to the temple, placed the envelope before God, and whispered, 'Rajesh, I did it. Our son will have his future.' That night, as she held Aarav close, she silently vowed to never let him feel the absence of a father again."
          ]
        },
        {
          "id": "b1-p4",
          "title": "Chapter 4: Steps into a New World",
          "content": [
            "Years passed, and Meera’s days found a rhythm — mornings spent preparing lunch for Aarav and herself, long hours at the government office typing endless forms, and evenings helping her son with his studies. Her coworkers often admired her quiet determination. She never complained about the heavy workload or the long bus rides. She had only one goal — to see her son become the man Rajesh had dreamed of.",

            "Aarav grew up watching his mother’s struggles and sacrifices. While his classmates boasted about gadgets or vacations, Aarav’s world revolved around books, notebooks, and the promise he made to himself — to make his mother proud. He excelled in school, often studying late into the night while Meera sat nearby, half asleep, her head resting against the wall but her eyes occasionally opening to check on him.",

            "When Aarav expressed his wish to become an engineer, Meera’s heart filled with both joy and fear. The coaching fees for entrance exams were steep, but she refused to let money decide her son’s fate. She sold her last gold bangle — a gift from her wedding — and used that money to enroll him in a coaching institute. Every evening she would wait outside after her office hours, just to accompany him back home safely through the crowded streets.",

            "When the entrance results finally came, Aarav had secured a seat in one of the top engineering colleges in Chennai. Meera cried silently in front of the temple, her palms folded tightly. The tuition was mostly covered by a government merit scholarship, but the hostel and other expenses still needed to be managed. She began taking typing work from home at night, earning a few hundred rupees extra. She never let Aarav see how tired she truly was; her smile never faded. To her, every sleepless night was an investment in his future.",

            "The day Aarav left for college, Meera accompanied him by train, carrying a small tiffin box packed with his favorite lemon rice. At the station, as he boarded, she adjusted his collar and said softly, 'Study well, my son. Don’t worry about me. I’ll manage.' As the train moved, she waved until his face disappeared, then turned away, wiping her tears. The platform echoed with the sound of the departing train, but inside her heart, a silent hope was beginning to grow."
          ]
        },
        {
          "id": "b1-p5",
          "title": "Chapter 5: The Weight of Sacrifice",
          "content": [
            "College life opened new doors for Aarav. He was surrounded by bright minds, advanced labs, and an environment that pushed him to think beyond textbooks. But amid all the progress, he often thought of his mother — her tired eyes, her quiet strength, and the old phone she still used just so he could have a laptop. Every Sunday evening, he would call her. Their conversations were short but filled with warmth — she would always ask if he was eating well, and he would always remind her to take her medicines on time. They both knew those words carried love far deeper than they said aloud.",

            "Meera, on her part, found joy in the smallest things — a postcard from Aarav, a photo from his college fest, or a phone call saying he topped another exam. Her life revolved around those moments. Her coworkers often teased her for talking about her son too much, but she didn’t care. In her heart, every bit of hardship felt lighter knowing it was shaping Aarav’s tomorrow.",

            "One evening, Aarav called her with a trembling voice. 'Amma… I got shortlisted for an international exchange program. It’s in Germany.' Meera froze for a second. She didn’t even know where Germany was on the map. 'Is it good?' she asked softly. 'Very good, Amma,' he replied, excitement bursting through his words. 'They’ll cover my tuition and accommodation — it’s a full scholarship!' Meera’s heart swelled with pride, but she also felt a lump in her throat. The scholarship covered most expenses, yes, but there were still flight tickets, documentation costs, and other formalities.",

            "That night, Meera sat quietly on the terrace under the pale moonlight. The cool breeze brushed against her face as she calculated everything in her mind. She had some savings, and if she took a small personal loan against her provident fund, she could manage. The next day, she did exactly that. She didn’t tell Aarav about it. She only said, 'Everything is taken care of, my son. Just study well and make me proud.'",

            "The day the visa arrived, Aarav ran home from college to tell her first. Meera cooked his favorite meal — puri and aloo curry — though her body ached from her long day at work. That night, they both sat on the balcony, talking about the future. Aarav spoke of machines, inventions, and dreams. Meera just listened, smiling through her tired eyes. She didn’t realize then that sometimes, fate watches the happiest moments closely — as if preparing to test how much a heart can truly bear."
          ]
        },
        {
          "id": "b1-p6",
          "title": "Chapter 6: Flight to a Dream",
          "content": [
            "The day of departure arrived faster than either of them had expected. The house was filled with a bittersweet silence as Meera helped Aarav pack his bags. Every shirt she folded carried the scent of home, every pair of socks tucked in with a mother’s unspoken prayer. Aarav moved around nervously, checking documents again and again. He was excited, but beneath that excitement was a quiet fear — of leaving his mother alone, of stepping into a world he had only seen in pictures.",

            "At the airport, Meera wore her best saree — the same one she had worn during Aarav’s school farewell. Her eyes followed him as he moved through the check-in counters, handling everything on his own. She stood at a distance, smiling proudly, even though her throat burned from holding back tears. When it was finally time to say goodbye, Aarav hugged her tightly. 'I’ll call you every day, Amma. And don’t forget to eat on time,' he said. Meera smiled and replied, 'You don’t worry about me, my son. Just remember why you started all this — for your father, and for yourself.'",

            "As Aarav walked away toward security, Meera’s hand slowly dropped from the air, her eyes moist but proud. The boy she had carried through hunger, sleepless nights, and endless prayers was now flying to a future she could barely imagine. As the plane took off, she whispered softly to herself, 'Go live your dream, my child… I’ve lived mine through you.'",

            "Back home, the emptiness hit her like a wave. She returned from work to silence — no shoes scattered at the door, no voice asking for tea. Still, she found comfort in small routines. She’d talk to his framed photograph every night, sometimes scolding him playfully for forgetting to call, other times crying softly when his calls got shorter due to his busy schedule. The loneliness was heavy, but it was filled with pride.",

            "In Germany, Aarav’s life became a whirlwind of lectures, projects, and internships. He made friends, adapted to the cold winters, and even learned to cook basic food. Every week, he sent a portion of his stipend home, saying, 'Just save it, Amma.' Meera used none of it for herself; she kept it safely aside for the future she hoped they would share. Little did they know that time had its own cruel script — one they couldn’t rewrite, no matter how hard they tried."
          ]
        },
        {
          "id": "b1-p7",
          "title": "Chapter 7: The Call That Broke the Sky",
          "content": [
            "It was a cold evening in Germany when Aarav’s phone rang. The display flashed ‘Amma’. He smiled instantly. He had just received an email confirming his job offer from a reputed automobile company — his first real job. He couldn’t wait to share the news. But when he picked up, it wasn’t his mother’s voice. It was someone else — a shaky, unfamiliar voice saying, 'Sir… are you Meera’s son?' Aarav froze, confusion rising in his chest. 'Yes, this is her son. Who’s this?' There was a pause, followed by words that didn’t make sense at first — 'Your mother… there’s been an incident… please come soon.'",

            "The world blurred. Aarav’s hands trembled, his heart pounding. The man on the other end tried to explain — an accident, a cab, heavy rain, something terrible had happened — but the words refused to form meaning in Aarav’s mind. His body went cold. He dropped the phone and sank to the floor, whispering, 'No… no, not Amma…' His roommate rushed in, but Aarav couldn’t speak. He just stared at the blank wall, his mind screaming silently.",

            "Within hours, he was on a flight home. He didn’t remember booking the ticket, didn’t remember the airport, didn’t feel the ground beneath him. All he could see in his mind was his mother’s face — smiling, proud, tired, full of love. Every image stabbed at his heart. During the flight, he looked out of the window, watching clouds drift by, whispering, 'Amma, please be okay… please wait for me.'",

            "When he landed and rushed to the hospital, the truth waited for him in the cruelest form — covered in a white sheet, silent and still. His legs gave out. The air left his lungs. The world tilted sideways as he screamed, the kind of scream that breaks through walls and hearts alike. His mother, his reason for living, his entire world, was gone — taken by the very cruelty she had spent her life fighting against."
          ]
        },
        {
          "id": "b1-p8",
          "title": "Chapter 8: The Last Rain",
          "content": [
            "That night, it rained again — the same kind of heavy, merciless rain that had taken Meera away. The city slept under thunder and lightning, but for Aarav, time had stopped. He sat on the cold hospital bench, his eyes fixed on the rain trickling down the window. Each drop felt like a memory — the way his mother would rush him inside during storms, how she’d scold him for getting drenched, how she’d dry his hair with her saree’s edge. Now, the rain mocked him — reminding him that she was gone forever.",

            "The police report was brief and brutal. Meera had taken a cab home after her late shift. The driver had driven her toward a deserted stretch, taking advantage of the storm that kept the streets empty. She had fought back — her nails, her bruises, her torn scarf told the story — but she was overpowered. When her body was found hours later, the rain had washed away most of the evidence. The officers spoke in mechanical tones, words like 'suspect', 'investigation', and 'post-mortem' echoing through Aarav’s numb mind. To them, it was another case. To him, it was the end of everything that ever mattered.",

            "At the funeral, neighbors whispered, wept, and shook their heads. Aarav stood like stone. He couldn’t cry anymore; the tears had run dry. As the pyre burned, he watched the flames rise, carrying the woman who had lived her life in sacrifice — only to be taken so mercilessly. In the crackle of fire, he could still hear her voice: 'Study well, my son.' He knelt down, pressed his forehead to the ground, and whispered through shaking lips, 'I did, Amma. I did. But what’s the point now?'",

            "That night, as the rain continued to fall, Aarav sat outside their house. The streetlight flickered, and thunder rolled in the distance. He looked up at the sky, tears mixing with rain, and whispered, 'You worked your whole life for me, Amma. You taught me strength, honesty, love — but this world didn’t deserve you.' The sound of the rain drowned his sobs, but somewhere deep inside, he felt her presence — not as pain, but as an echo of everything pure that once existed in his life."
          ]
        },
        {
          "id": "b1-p9",
          "title": "Chapter 9: The Silent Return",
          "content": [
            "Days turned into weeks, but for Aarav, life had lost all rhythm. The world outside continued — offices opened, buses honked, people laughed — yet everything felt muted. He stopped eating, stopped sleeping, barely spoke to anyone. The house, once filled with his mother’s voice, now echoed with silence. Every corner carried her memory — her saree still hanging on the wall, her handwriting on the calendar, her slippers near the door. He couldn’t move them. He couldn’t let go.",

            "The trial began, but justice crawled at its own cruel pace. The cab driver was caught, but the system moved in circles — witnesses changing statements, lawyers delaying hearings, and officials treating it as just another file. Aarav attended every session, watching, listening, feeling rage and helplessness grow inside him. He wanted to scream at the courtroom — to tell them that she was not just a name on a report, not another statistic — she was his mother, the woman who worked her whole life so he could stand where he was.",

            "Some nights, he would walk to her old office and stand outside the gate, staring at the window where she used to sit. The security guard, recognizing him, would nod silently. Aarav didn’t say a word; he would just stand there in the faint glow of the streetlights, remembering how she’d wave from that very spot. Sometimes, he imagined her stepping out again, adjusting her saree, carrying her lunch box, smiling at him like she always did. But the gate remained closed. Reality remained cruel.",

            "Six months later, when his company sent a letter asking when he would join, Aarav stared at it for a long time. He had once dreamed of returning with success, of hugging his mother and saying, 'Amma, your struggle paid off.' Now there was no one waiting. He finally packed his mother’s photo into his bag, kissed it gently, and whispered, 'I’ll go, Amma. Not because I want to, but because I know you’d want me to.' As he boarded the flight, he felt the silence beside him — the silence of everything he had lost."
          ]
        },
        {
          "id": "b1-p10",
          "title": "Chapter 10: A Mother’s Name Lives On",
          "content": [
            "Months later, in Germany, the snow fell gently outside Aarav’s small apartment window. Life had moved on, as it always does, but inside him, time stood still. He went to work every day, did well, even earned appreciation — yet the joy that once fueled him was gone. His colleagues spoke of promotions and travel plans; he just listened quietly, his thoughts drifting back to the little house in India where his mother used to wait with hot tea and a smile that could erase every worry.",

            "One evening, after work, he walked through the city park, holding a small diary — the one his mother had used to record monthly expenses. Between the faded numbers and grocery lists, he found small notes she had written to herself — 'Aarav’s college fees due next month.' 'Buy his favorite sweet for his birthday.' 'Don’t let him see you cry.' Each line felt like a stab to his heart. He sat on a bench and wept silently, realizing how her love had been hidden in every ordinary act of her life.",

            "In the following months, Aarav decided to do something that would carry her name forward. He used a part of his salary to start a small foundation in India — 'The Meera Trust' — to support education for children of single mothers. He didn’t want anyone else’s child to face the kind of fear and loneliness he had. He wanted her name to stand not as a symbol of tragedy, but as a reminder of strength — of the countless women who fight battles the world never sees.",

            "On the anniversary of her death, he returned to India quietly. There were no ceremonies, no grand gestures — just him, standing before her framed photograph in the small living room. He lit a lamp, placed a single rose beside it, and whispered, 'You did it, Amma. You won. The world may have broken you, but it can never erase what you built inside me.' The wind outside carried the faint scent of rain, and for the first time in months, Aarav felt a strange peace — as if, somewhere above, she was still watching, still blessing, still whispering, 'I’m proud of you, my son.'"
          ]
        }
      ]
    }
  ]
}
